read_verilog __PRIMS__

read_verilog -DGLBL  __OUT__/__SYNTH__.v
rename __SYNTH__ synth

read_verilog -DGLBL __OUT__/__IMPL__.v
rename __IMPL__ impl

miter -equiv -make_assert synth impl eq_top

hierarchy -top eq_top;

proc; flatten;

dffunmap

write_smt2 __OUT__/eq_top.smt2
sat -dump_vcd __OUT__/counter_example.vcd -verify-no-timeout -timeout 1 -prove-asserts -tempinduct eq_top
