read_verilog -lib __PRIMS__

read_verilog -DGLBL __OUT__/__SYNTH__.v
rename __SYNTH__ gold
show -format dot -prefix __OUT__/synth

read_verilog -DGLBL __OUT__/__IMPL__.v
rename __IMPL__ gate
show -format dot -prefix __OUT__/impl

select gold
write_json -noscopeinfo -selected __OUT__/__JSON__
select -clear

equiv_make gold gate equiv_top;

proc;

equiv_struct             equiv_top
equiv_status   -assert   equiv_top